In [1]:
import pandas as pd
import numpy as np

In [2]:
user_cols = ['user_id','age','sex','occupation','zip_code']
users = pd.read_csv('ml-100k/u.user', sep='|', names = user_cols, encoding = 'latin-1')

ratings_cols = ['user_id','movie_id','rating','unix_timestamp']
ratings = pd.read_csv('ml-100k/u.data', sep='\t', names = ratings_cols, encoding = 'latin-1')

movies_cols = ['movie_id','title','release_date','video_release_date','imdb_url']
movies = pd.read_csv('ml-100k/u.item', sep='|', names = movies_cols,usecols = range(5),
                     encoding = 'latin-1')

In [4]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [6]:
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [7]:
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [13]:
movies.drop(['video_release_date','imdb_url'],inplace=True,axis = 1)

In [14]:
movies.head()

   movie_id              title release_date
0         1   Toy Story (1995)  01-Jan-1995
1         2   GoldenEye (1995)  01-Jan-1995
2         3  Four Rooms (1995)  01-Jan-1995
3         4  Get Shorty (1995)  01-Jan-1995
4         5     Copycat (1995)  01-Jan-1995

In [27]:
genres_list = ['unknown','Action','Adventure','Animation','Children','Comedy','Crime',
               'Documentary','Drama','Fantasy','Film-Noir','Horror','Musical','Mystery',
               'Romance','Sci-Fi','Thriller','War','Western']
genre = pd.read_csv('ml-100k/u.item', sep='|',names = genres_list,usecols = range(5,24),encoding = 'latin-1')

In [28]:
genre.columns

Index([u'unknown', u'Action', u'Adventure', u'Animation', u'Children',
       u'Comedy', u'Crime', u'Documentary', u'Drama', u'Fantasy', u'Film-Noir',
       u'Horror', u'Musical', u'Mystery', u'Romance', u'Sci-Fi', u'Thriller',
       u'War', u'Western'],
      dtype='object')

In [29]:
genre.head()

,unknown,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
3,0,1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0

In [30]:
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [31]:
ratings.drop('unix_timestamp',axis = 1,inplace=True)

In [32]:
ratings.head()

   user_id  movie_id  rating
0      196       242       3
1      186       302       3
2       22       377       1
3      244        51       2
4      166       346       1

In [35]:
ratings['rating'].value_counts()

4    34174
3    27145
5    21201
2    11370
1     6110
Name: rating, dtype: int64

In [36]:
dataset = pd.merge(pd.merge(movies, ratings),users)

In [37]:
dataset.head()

,movie_id,title,release_date,user_id,rating,age,sex,occupation,zip_code
0,1,Toy Story (1995),01-Jan-1995,308,4,60,M,retired,95076
1,4,Get Shorty (1995),01-Jan-1995,308,5,60,M,retired,95076
2,5,Copycat (1995),01-Jan-1995,308,4,60,M,retired,95076
3,7,Twelve Monkeys (1995),01-Jan-1995,308,4,60,M,retired,95076
4,8,Babe (1995),01-Jan-1995,308,5,60,M,retired,95076

In [39]:
dataset[['title','rating']].sort_values('rating', ascending=False).head(20)

                                 title  rating
48743             Birdcage, The (1996)       5
46595       Singin' in the Rain (1952)       5
20919           Shall We Dance? (1937)       5
46621             Dumb & Dumber (1994)       5
20917       Walking and Talking (1996)       5
20914  When a Man Loves a Woman (1994)       5
46625     Bullets Over Broadway (1994)       5
20911               Prefontaine (1997)       5
91551               Hoop Dreams (1994)       5
86864             Kaspar Hauser (1993)       5
20900    Some Kind of Wonderful (1987)       5
91548               Taxi Driver (1976)       5
76952           Shall We Dance? (1996)       5
95815       Princess Bride, The (1987)       5
20894             Reality Bites (1994)       5
20893                  War, The (1994)       5
91546               Postino, Il (1994)       5
76958            Secrets & Lies (1996)       5
76959      English Patient, The (1996)       5
20885                  Gaslight (1944)       5

In [40]:
genre.head()

,unknown,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
3,0,1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0

In [47]:
genre.sum().sort_values(ascending=False)

Drama          725
Comedy         505
Thriller       251
Action         251
Romance        247
Adventure      135
Children       122
Crime          109
Sci-Fi         101
Horror          92
War             71
Mystery         61
Musical         56
Documentary     50
Animation       42
Western         27
Film-Noir       24
Fantasy         22
unknown          2
dtype: int64

In [48]:
from sklearn.metrics.pairwise import cosine_similarity

In [49]:
cosine_sim = cosine_similarity(genre)
cosine_sim[:4, :4]

array([[1.        , 0.        , 0.        , 0.33333333],
       [0.        , 1.        , 0.57735027, 0.33333333],
       [0.        , 0.57735027, 1.        , 0.        ],
       [0.33333333, 0.33333333, 0.        , 1.        ]])

In [51]:
titles = movies['title']
indices = pd.Series(movies.index,index=movies['title'])

In [54]:
def generate_recommendations(title):
    index = indices[title]
    sim_scores = list(enumerate(cosine_sim[index]))
    sim_scores = sorted(sim_scores, key=lambda x: x[1], reverse=True)
    sim_scores = sim_scores[1:21]
    movie_indices = [i[0] for i in sim_scores]
    return titles.iloc[movie_indices]

In [56]:
generate_recommendations('Good Will Hunting (1997)').head(20)

8                                Dead Man Walking (1995)
14                             Mr. Holland's Opus (1995)
17                             White Balloon, The (1995)
18                                 Antonia's Line (1995)
29                                  Belle de jour (1967)
36                                          Nadja (1994)
45                                        Exotica (1994)
51                    Madness of King George, The (1994)
56                                         Priest (1994)
57                                      Quiz Show (1994)
58                              Three Colors: Red (1994)
59                             Three Colors: Blue (1993)
60                            Three Colors: White (1994)
63                      Shawshank Redemption, The (1994)
85                        Remains of the Day, The (1993)
86                    Searching for Bobby Fischer (1993)
106                                 Moll Flanders (1996)
112    Horseman on the Roof, The (Hussard sur le toit...
125                           Spitfire Grill, The (1996)
133                                  Citizen Kane (1941)
Name: title, dtype: object

In [58]:
generate_recommendations('Toy Story (1995)').head(20)

421     Aladdin and the King of Thieves (1996)
94                              Aladdin (1992)
1218                     Goofy Movie, A (1995)
62                    Santa Clause, The (1994)
93                           Home Alone (1990)
101                     Aristocats, The (1970)
137                D3: The Mighty Ducks (1996)
138                       Love Bug, The (1969)
168                 Wrong Trousers, The (1993)
188                    Grand Day Out, A (1992)
224                      101 Dalmatians (1996)
239     Beavis and Butt-head Do America (1996)
242                       Jungle2Jungle (1997)
258                George of the Jungle (1997)
260                             Air Bud (1997)
376                        Heavyweights (1994)
382                    Flintstones, The (1994)
399                 Little Rascals, The (1994)
403                           Pinocchio (1940)
476                             Matilda (1996)
Name: title, dtype: object